Documents/ВСД2_Производство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_Производство</Name>
			<Comment>api 2.*</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.кб_НезавершенныеПроизводственныеТранзакции</xr:Item>
				<xr:Item>AccumulationRegister.кб99_ОстаткиПартийВСД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cargoInspected</Name>
					<Comment>Отметка об обследовании партии продукции ветеринарным врачом.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыИсследований</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кб99_РезультатИсследования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>operationId</Name>
					<Comment>№ транзакции при НЗП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьОперацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершениеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Можно фасовку добавить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Comment>1 - приход,0 - расход</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПродукции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скоропортящийся</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Некачественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество1с</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УровниУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_Маркировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/кб99_СтатусЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кб99_СтатусЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>COMPLETED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REJECTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IN_PROCESS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ACCEPTED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВСД2_Производство/Forms/ФормаСпискаНезавершенногоПроизводства/Ext/Form/Module.bsl
// GRACE:MODULE_START name="ПроизводствоВСД"
// @grace-module: ПроизводствоВСД
// @grace-purpose: Форма списка незавершённого производства — выбор, завершение и оформление производственных транзакций
// @grace-depends: ЯдроВСД, ИнтеграцияВетИС_API, ПроизводствоВСД
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ПроизводствоВСД"
// GRACE:DEPENDENCY target="кб99_ВСД"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"
// GRACE:DEPENDENCY target="ВетИС_ПроизводствоСервер"

// @grace-contract: кнЗавершитьПроизводствоОтвет
//   Вход: Ответ (КодВозвратаДиалога) — ответ пользователя на вопрос
//   Вход: ДопПараметры — дополнительные параметры
//   Выход: нет
//   Исключение: нет
//   Инвариант: нет
//   GRACE-лог: нет
// GRACE:CONTRACT function="кнЗавершитьПроизводствоОтвет"

// @grace-contract: ПослеВводаДатыПроизводства
//   Вход: ВыбДата (Дата) — выбранная дата производства
//   Вход: Результат (Структура) — структура с данными для оповещения
//   Выход: нет
//   Исключение: нет
//   Инвариант: нет
//   GRACE-лог: нет
// GRACE:CONTRACT function="ПослеВводаДатыПроизводства"


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("НезавершенныеТранзакции") Тогда
		Организация = Параметры.Организация;
		тзНезавершенноеПроизводство = ПолучитьИзВременногоХранилища(Параметры.НезавершенныеТранзакции);
		Для Каждого Стр Из тзНезавершенноеПроизводство Цикл
			нСтр = СписокДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр, Стр);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СтрокаТч = Элемент.ТекущиеДанные;

	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", СтрокаТЧ.НомерОперации);

	ВводДатыПроизводства(Результат);

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)

	СтрокаТч = Элементы.СписокДокументов.ТекущиеДанные;

	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", СтрокаТЧ.НомерОперации);

	ВводДатыПроизводства(Результат);

КонецПроцедуры

&НаКлиенте
Процедура кнЗавершитьВыбранныеТранзакции(Команда)

	ПредставлениеДокументыКЗавершению = "";

	Для Каждого Стр Из СписокДокументов Цикл
		Если Стр.Отметка Тогда
			ПредставлениеДокументыКЗавершению = ПредставлениеДокументыКЗавершению +", "+ Стр.НомерОперации;
		КонецЕсли;
	КонецЦикла;

	ПервыйСимвол = Лев(ПредставлениеДокументыКЗавершению, 1);
	Если ПервыйСимвол = "," Тогда
		ПредставлениеДокументыКЗавершению = Прав(ПредставлениеДокументыКЗавершению, СтрДлина(ПредставлениеДокументыКЗавершению)-2);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПредставлениеДокументыКЗавершению) Тогда
		Возврат;
	КонецЕсли;

	ТекстВопроса = "Будут завершены производственные транзакции №: "+ПредставлениеДокументыКЗавершению+"
					| Продолжить?";

	Оповещение = Новый ОписаниеОповещения("кнЗавершитьПроизводствоОтвет", ЭтаФорма);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, "");

КонецПроцедуры

&НаКлиенте
Процедура ОформитьНовоеПроизводство(Команда)

	Результат = Новый Структура;
	Результат.Вставить( "НомерНезавершенногоПроизводства", Неопределено);
	Результат.Вставить( "ЗавершитьОперацию", Ложь );

	ВводДатыПроизводства(Результат);

КонецПроцедуры

&НаСервере
Функция кнЗавершитьВыбранныеТранзакцииНаСервере()

	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );
   	ПараметрыОрганизации.Вставить( "ЗавершитьПроизводство", Истина );

	МассивЗавершенных = Новый Массив;

	Для Каждого СтрТЧ Из СписокДокументов Цикл
		Если СтрТЧ.Отметка Тогда

			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("ПараметрыОрганизации", ПараметрыОрганизации);
			ПараметрыЗаполнения.Вставить("Площадка", СтрТЧ.Площадка);
			ПараметрыЗаполнения.Вставить("НомерОперации", СтрТЧ.НомерОперации);
			ПараметрыЗаполнения.Вставить("СписокПродукции", СтрТЧ.СписокПродукции.ВыгрузитьЗначения());

			СтрТЧ.Документ = ВетИС_ПроизводствоСервер.ОформитьДокументЗавершенияПроизводства(ПараметрыЗаполнения);
			СтрТЧ.СтатусЗапроса = ВетИС_APIСервер.ЗавершитьПроизводство( ПараметрыОрганизации, СтрТЧ.Документ );

			Если СтрТЧ.СтатусЗапроса = Перечисления.кб99_СтатусЗапроса.COMPLETED Тогда
				МассивЗавершенных.Добавить(СписокДокументов.Индекс(СтрТЧ));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Для Каждого Стр Из МассивЗавершенных Цикл
		СписокДокументов.Удалить(Стр);
	КонецЦикла;

КонецФункции

&НаКлиенте
Процедура ВводДатыПроизводства(ДополнительныеПараметры)

	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатыПроизводства", ЭтаФорма, ДополнительныеПараметры);
	ВыбДата = ТекущаяДата();
	ПоказатьВводДаты( Оповещение, ВыбДата , "Дата выпуска продукции",  ЧастиДаты.Дата);

КонецПроцедуры

&НаКлиенте
Процедура кнЗавершитьПроизводствоОтвет(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		кнЗавершитьВыбранныеТранзакцииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыПроизводства(ВыбДата, Результат) Экспорт

	Если ВыбДата = Неопределено Тогда
		ВетИС_ЯдроСервер.СообщитьИнфо("Отменено");
		Возврат;
	Иначе

		Результат.Вставить("ДатаПроизводства", ВыбДата);

		Оповестить( "ВыборНезавершенногоПроизводства", Результат );

		Закрыть();

	КонецЕсли;

КонецПроцедуры
// GRACE:MODULE_END name="ПроизводствоВСД"
